Repository: KeithDHedger/KKEdit
Catalog: kkedit_*.po
Languages: fr_fr

source: _Yes
fr_fr: _Oui

source: _No
fr_fr: _Non

source: _Cancel
fr_fr: _Annuler

source: _Open
fr_fr: _Ouvrir

source: Select Colour
fr_fr: Sélectionner la couleur

source: _Apply
fr_fr: _Appliquer

source: _Edit
fr_fr: É_diter

source: _File
fr_fr: _Fichier

source: Open As He_xdump
fr_fr: Ouvrir en vue he_xadécimale

source: _New
fr_fr: _Nouveau

source: New A_dmin Editor
fr_fr: Nouvelle fenêtre (_administrateur)

source: New _Editor
fr_fr: Nouvelle _fenêtre

source: _Manpage Editor
fr_fr: Éditeur de pages de _manuel

source: B_uild Documentation
fr_fr: _Construire la documentation

source: _Recent Files
fr_fr: Fichiers _récents

source: _Save
fr_fr: _Enregistrer

source: Save _As...
fr_fr: Enre_gistrer sous...

source: Save A_ll
fr_fr: _Tout enregistrer

source: Sa_ve Session
fr_fr: Enregistrer la _session

source: Res_tore Session
fr_fr: _Restaurer la session

source: _Print...
fr_fr: _Imprimer...

source: _Close
fr_fr: Fer_mer

source: Close All Ta_bs
fr_fr: Fermer tous les ong_lets

source: Re_vert
fr_fr: Rétablir

source: _Quit
fr_fr: _Quitter

source: _Undo
fr_fr: Annuler

source: _Redo
fr_fr: _Rétablir

source: U_ndo All
fr_fr: Tout a_nnuler

source: Re_do All
fr_fr: Tout réta_blir

source: Cu_t
fr_fr: Co_uper

source: _Copy
fr_fr: Co_pier

source: _Paste
fr_fr: Co_ller

source: _Find
fr_fr: Re_chercher

source: _Sort Tabs
fr_fr: _Trier les onglets

source: S_how All Tabs
fr_fr: _Afficher tous les onglets

source: _Hide Tab
fr_fr: _Cacher l'onglet

source: Se_lect Tab
fr_fr: _Sélectionnez l'onglet

source: Pr_eferences
fr_fr: _Préférences

source: Plu_gin Prefs
fr_fr: Préférences des _greffons

source: _View
fr_fr: _Affichage

source: Show Documentation
fr_fr: Montrer la documentation

source: Hide Bookmarks Bar
fr_fr: Cacher la barre des signets

source: Show Bookmarks Bar
fr_fr: Montrer la barre des signets

source: Hide Tool Bar
fr_fr: Cacher la barre d'outils

source: Show Tool Bar
fr_fr: Montrer la barre d'outils

source: Hide Tool Output
fr_fr: Cacher la sortie des outils

source: Show Tool Output
fr_fr: Montrer la sortie des outils

source: Hide Status Bar
fr_fr: Cacher la barre d'état

source: Show Status Bar
fr_fr: Montrer la barre d'état

source: Show Docviewer
fr_fr: Montrer le visionneur de documents

source: Hide Docviewer
fr_fr: Cacher le visionneur de documents

source: Show Line Numbers
fr_fr: Montrer le numéro des lignes

source: Wrap Lines
fr_fr: Activer le retour à la ligne

source: Hightlght Current Line
fr_fr: Surligner la ligne en cours

source: No Syntax Highlighting
fr_fr: Désactiver la coloration syntaxique

source: Show Whitespace
fr_fr: Afficher les blancs

source: Auto Show Completions
fr_fr: Montrer automatiquement les complétions

source: Go To _Definition
fr_fr: Aller à la définition

source: Open Include File
fr_fr: Ouvrir l'en-tête

source: _Go To Line
fr_fr: Aller à la _ligne...

source: Search For Define
fr_fr: Chercher une définition

source: _Search In Gtk Docs
fr_fr: Chercher dans les documents _Gtk

source: S_earch In Qt5 Docs
fr_fr: Chercher dans les documents _Qt5

source: _Find In Documentation
fr_fr: _Rechercher dans la documentation

source: _Back
fr_fr: _Précédent

source: Fun_ctions
fr_fr: Fon_ctions

source: _Bookmarks
fr_fr: _Signets

source: Toggle Bookmark
fr_fr: Placer un signet

source: Remove All Bookmarks
fr_fr: Retirer tous les signets

source: _Tools
fr_fr: _Outils

source: Manage External Tools
fr_fr: Gérer les outils externes

source: Plu_gins
fr_fr: _Greffons

source: _Help
fr_fr: A_ide

source: _About
fr_fr: À _propos

source: _Online Help
fr_fr: Aide en _ligne

source: _Get Plugins
fr_fr: _Obtenir des greffons

source: Definition
fr_fr: Aller à la _définition

source: Open
fr_fr: Ouvrir

source: Close
fr_fr: Fermer

source: New
fr_fr: Nouveau

source: Save
fr_fr: Enregistrer

source: Undo
fr_fr: Annuler

source: Redo
fr_fr: Rétablir

source: Cut
fr_fr: Couper

source: Copy
fr_fr: Copier

source: Paste
fr_fr: Coller

source: Find
fr_fr: Trouver

source: Back
fr_fr: Précédent

source: Forward
fr_fr: Suivant

source: _Add To Custom Word List
fr_fr: _Ajouter à la liste des mots personnalisés

source: C_heck Spellling
fr_fr: _Vérifier l'orthographe

source: Copy Folder Path
fr_fr: Copier le chemin du dossier parent

source: Copy Filepath
fr_fr: Copier le chemin du fichier

source: Copy FileName
fr_fr: Copier le nom du fichier

source: Source Highlight
fr_fr: Coloration syntaxique

source: Spell Check Document
fr_fr: Vérifier l'orthographe du document

source: Refresh
fr_fr: Rafraîchir

source: Bookmark
fr_fr: Signet

source: Checking for updates ...
fr_fr: Recherche de mises à jour ...

source: KKEdit update available to
fr_fr: Mises à jour pour KKEdit disponibles de

source: from
fr_fr: vers

source: From here
fr_fr: vers

source: Plugin updates are available from here
fr_fr: Des mises à jour pour les greffons sont disponibles ici

source: Updates Available
fr_fr: Mises à jour disponibles

source: Replaced %i instances of '%s' with '%s'
fr_fr: %i instances de '%s' remplacées par '%s'

source: Save file %s before closing?
fr_fr: Enregistrer le fichier %s avant de fermer?

source: Warning unsaved data!
fr_fr: Attention, données non enregistrées

source: Line %i Column %i Syntax Highlighting %s FilePath %s
fr_fr: Ligne %i Colonne %i Coloration syntaxique %s Chemin du fichier %s

source: Untitled
fr_fr: Sans nom

source: Can't save file '%s' :(
fr_fr: Impossible d'enregistrer le fichier '%s' :(

source: Define Keyboard Shortcuts
fr_fr: Définir des raccourcis clavier

source: To set a custom shortcut: Click in the appropriate box and press CONTROL(and optionally SHIFT ) plus your custom key. Just press 'Delete' to remove the shortcut Click 'Apply' to keep changes or 'Cancel' to discard any changes.
fr_fr: Pour personnaliser un raccourci: Cliquez dans la boîte appropriée et maintenez Ctrl (et optionnellement Maj) ainsi que la touche personnalisée. Appuyez simplement sur la touche Suppr pour supprimer le raccourci. Cliquez sur 'Appliquer' pour garder les changements ou sur 'Annuler' pour annuler toute modification.

source: Delete Current Line
fr_fr: Supprimer la ligne en cours

source: Delete To End Of Line
fr_fr: Supprimer jusqu'à la fin de la ligne

source: Delete To Beginning Of Line
fr_fr: Supprimer jusqu'au début de la ligne

source: Select Word Under Cursor
fr_fr: Sélectionner le mot sous le curseur

source: Delete Word Under Cursor
fr_fr: Supprimer le mot sous le curseur

source: Duplicate Current Line
fr_fr: Dupliquer la ligne

source: Select Current Line
fr_fr: Sélectionner la ligne en cours

source: Move Current Line Up
fr_fr: Déplacer la ligne en haut

source: Move Current Line Down
fr_fr: Déplacer la ligne en bas

source: Select From Cursor To End Of Line
fr_fr: Sélectionner du curseur jusqu'à la fin de la ligne

source: Select From Beginning Of Line To Cursor
fr_fr: Sélectionner du début de la ligne jusqu'au curseur

source: Move Selection Up
fr_fr: Déplacer la sélection à la ligne du dessus

source: Move Selection Down
fr_fr: Déplacer la sélection à la ligne du dessous

source: Show Completion
fr_fr: Montrer la complétion

source: Hide Tab
fr_fr: Cacher l'onglet

source: New File
fr_fr: Nouveau

source: Open File
fr_fr: Ouvrir

source: Save File
fr_fr: Enregistrer

source: Open Recent File
fr_fr: Ouvrir un fichier récent

source: Go To Definition
fr_fr: Aller à la définition

source: Go Back
fr_fr: Vue précédente

source: Back To
fr_fr: Revenir à

source: Go Forward
fr_fr: Aller en avant

source: Forward To
fr_fr: Avancer à

source: Go To Line
fr_fr: Aller à la ligne...

source: Find API In Gtk Docs
fr_fr: Trouver l'API dans les documents Gtk

source: Find API In Qt5 Docs
fr_fr: Trouver l'API dans la documentation Qt5

source: Live Search
fr_fr: Recherche rapide

source: Separator
fr_fr: Séparateur

source: Expander
fr_fr: Étendre

source: PLACEHOLDERS: %t - Currently selected text. Passed to command as $KKEDIT_SELECTION %f - Filepath of the current document. Passed to command as $KKEDIT_CURRENTFILE %d - Directory of the current document or $HOME. Passed to command as $KKEDIT_CURRENTDIR %i - The location of the globally installed tools. Passed to command as $KKEDIT_DATADIR %h - Tempory file for displaying html in doc viewer. Passed to command as $KKEDIT_HTMLFILE %l - Highlihting language. Passed to command as $KKEDIT_SOURCE_LANG
fr_fr: Variables de substitution: %t - Texte sélectionné. Passé à la commande par $KKEDIT_SELECTION %f - Chemin du fichier en cours. Passé à la commande par $KKEDIT_CURRENTFILE %d - Répertoire contenant le document en cours ou $HOME. Passé à la commande par $KKEDIT_CURRENTDIR %i - L'emplacement des outils installés pour l'ensemble du système. Passé à la commande par $KKEDIT_DATADIR %h - Fichier temporaire pour afficher les pages HTML dans le visionneur de documents. Passé à la commande par $KKEDIT_HTMLFILE %l - Langage pour la coloration syntaxique. Passé à la commande par $KKEDIT_SOURCE_LANG

source: Edit External Tools
fr_fr: Éditer les outils externes

source: Tool Name:
fr_fr: Nom de l'outil:

source: Command:
fr_fr: Commande:

source: Shortcut:
fr_fr: Raccourci:

source: Comment:
fr_fr: Commentaire:

source: Run Tool In Terminal
fr_fr: Exécuter dans un terminal

source: Show Tool In Pop-Up Menu
fr_fr: Montrer l'outil dans le menu pop-up

source: Always Show Tool In Pop-Up Menu
fr_fr: Toujours montrer l'outil dans le menu pop-up

source: Run Tool Synchronously
fr_fr: Exécuter de manière synchrone

source: Show HTML Doc
fr_fr: Montrer la documentation HTML

source: Clear Tool Output First
fr_fr: Effacer d'abord la sortie des outils

source: Run Tool As Root
fr_fr: Exécuter en tant qu'administrateur

source: Use Progress Bar
fr_fr: Utiliser une barre de progression

source: Ignore Output
fr_fr: Ignorer la sortie

source: Paste Output
fr_fr: Coller la sortie

source: Replace All Contents
fr_fr: Remplacer tous les contenus

source: View Output
fr_fr: Afficher la sortie

source: Delete
fr_fr: Supprimer

source: <b>Customize Tool Bar</b>
fr_fr: <b>Personnaliser la barre d'outils</b>

source: Auto Indent Lines
fr_fr: Auto-indentation

source: Highlight Current Line
fr_fr: Surligner la ligne en cours

source: Use Single Instance
fr_fr: Autoriser une seule instance

source: Auto Save/Restore Session
fr_fr: Enregistrer/Restaurer automatiquement la session

source: Restore Session Bookmarks
fr_fr: Restaurer la session avec les signets

source: Don't Open Duplicate File
fr_fr: Ne pas ouvrir deux fois le même fichier

source: Don't Warn On File Change
fr_fr: Ne pas avertir lorsqu'un fichier a été modifié

source: Read Link Before Opening File
fr_fr: Suivre les liens avant d'ouvrir un fichier

source: Auto Search Docs
fr_fr: Chercher automatiquement dans les documents

source: General Appearance
fr_fr: Apparence général

source: Tab width:
fr_fr: Largeur de tabulation:

source: Theme:
fr_fr: Thème:

source: Font:
fr_fr: Police:

source: Bookmark Highlight Colour:
fr_fr: Couleur de surlignage:

source: Completion Minimum Word Size:
fr_fr: Taille minimale des mots pour la complétion:

source: Notebook Tab Size:
fr_fr: Taille des onglets:

source: Display functions etc in menu by type and alphabetically
fr_fr: Afficher les fonctions dans le menu selon leur type et par ordre alphabétique

source: Display functions etc in menu by type and file position
fr_fr: Afficher les fonctions dans le menu selon leur type et leur position

source: Display functions etc in menu by file position
fr_fr: Afficher les fonctions dans le menu selon leur position

source: Display functions etc in menu alphabetically
fr_fr: Afficher les fonctions dans le menu par ordre alphabétique

source: Display functions etc in menu in categorised format
fr_fr: Afficher les fonctions dans le menu par catégorie

source: Customize Keyboard Shortcuts
fr_fr: Personnaliser les raccourcis clavier

source: Text Style
fr_fr: Style du texte

source: Tag File Search Depth:
fr_fr: Profondeur de recherche dans les sous-répertoires:

source: Terminal Command:
fr_fr: Commande de terminal:

source: Run As Root Command:
fr_fr: Commande d’exécution en tant qu'administrateur:

source: Default Browser:
fr_fr: Navigateur web par défaut:

source: Max Find/Replace History:
fr_fr: Max Rechercher / Remplacer Histoire

source: Max Characters In Tab:
fr_fr: Max Caractères dans Tab:

source: Max Characters In Function Defs:
fr_fr: Caractères max de la fonction Defs:

source: Max Characters In Bookmarks:
fr_fr: Caractères max dans les signets:

source: Max Back/Forward History:
fr_fr: Maximum de retours en arrière/avant de l'historique:

source: Check For Updates
fr_fr: Rechercher des mises à jour

source: Use Global Plugins Menu( Requires Restart )
fr_fr: Utilisez le menu général des greffons ( Nécessite un redémarrage )

source: <b>Be Kind To Poor Programmers</b>
fr_fr: <b>Soyez gentil envers les programmeurs pauvres</b>

source: I have donated
fr_fr: J'ai déjà fait un don

source: I have really donated some some money to the author. My conscience is clear and my Karma is squeaky clean :)
fr_fr: J'ai vraiment déjà fait un don à l'auteur. Ma conscience est tranquille et mon Karma est irréprochable :)

source: Find/Replace
fr_fr: Trouver/Remplacer

source: Find Text
fr_fr: Trouver

source: Replace With
fr_fr: Remplacer par

source: Case insensitive
fr_fr: Casse insensible

source: Use Regex
fr_fr: Expression régulière

source: Wrap
fr_fr: Recherche circulaire

source: All Files
fr_fr: Tous les fichiers

source: Highlight All
fr_fr: Tout surligner

source: Replace All
fr_fr: Tout remplacer

source: _Replace
fr_fr: _Remplacer

source: _Replace All
fr_fr: Tout re_mplacer

source: Spell check word
fr_fr: Vérifier l'orthographe du mot

source: Change <i><b>%s</b></i> to:
fr_fr: Changer <i><b>%s</b></i> en:

source: Ignore
fr_fr: Ignorer

source: _Add
fr_fr: _Ajouter

source: Enter Function Name
fr_fr: Donnez le nom d'une fonction

source: Find Function
fr_fr: Trouver une fonction

source: For_ward
fr_fr: _Suivant

source: Please donate
fr_fr: Faites un don, s'il vous plaît

source: If you have a PayPal account you can donate any amount you like by logging into yor account and click the 'Send Money' tab, enter my email address
fr_fr: Si vous disposez d'un compte PayPal, vous pourrez faire un don de n'importe quel montant en vous connectant à votre compte et en allant dans l'onglet 'Envoi d'argent'. Entrez mon adresse courriel

source: and then send it.
fr_fr: et envoyez.

source: Thank you for helping to support Free software.
fr_fr: Merci d'aider à soutenir le logiciel libre.

source: Enter Line Number
fr_fr: Donnez le numéro d'une ligne

source: Building Documentaion ...
fr_fr: Documentation en construction ...

source: Do you want to replace in ALL open files?
fr_fr: Voulez-vous remplacer dans TOUS les fichiers ouverts ?

source: What Do You Want To Do?
fr_fr: Que voulez-vous faire?

source: Are you sure you want to delete
fr_fr: Êtes-vous sûr de vouloir supprimer

source: More by the same author
fr_fr: Plus du même auteur

source: KKEdit Code Text Editor
fr_fr: Éditeur de code source KKEdit

source: French Translation
fr_fr: Traduction française

source: GTK3 Application Icon
fr_fr: Icône de l'application GTK3

source: Restoring Session ...
fr_fr: Restaurer la session ...

source: File %s Has Changed on disk Do you want to reload it?
fr_fr: Le fichier %s a été modifié Voulez-vous le recharger?

source: Warning file changed!
fr_fr: Attention le fichier a été modifié!

source: File '%s' doesn't exist :(
fr_fr: Le fichier '%s' n'existe pas :(

source: Can't open file '%s' :(
fr_fr: Impossible d'ouvrir le fichier '%s' :(

source: Contains non text data,continue loading?
fr_fr: Contient des données non textuelles, continuer le chargement?

source: Doc Viewer
fr_fr: Visionneur de documents

source: _Home
fr_fr: _Accueil

source: _Down
fr_fr: _Descendre

source: _Up
fr_fr: En haut

source: Gtk Docs
fr_fr: Documents Gtk

source: Doxygen Docs
fr_fr: Documents Doxygen

source: Qt5 Docs
fr_fr: Documentation Qt5

source: KKEdit Help
fr_fr: _Aide

source: Searching Google...
fr_fr: Recherche sur Google en cours ...

source: Plugin '%s' cannot be unloaded yet. Restart KKEdit to unload.
fr_fr: Le greffon '%s' ne peut pas être décharger maintenant. Relancer KKEdit pour ce faire.

source: Enable
fr_fr: Activer

source: Plug In
fr_fr: Greffon

source: Functions
fr_fr: Fonctions

source: Custom Words
fr_fr: Mots personnalisés
